---
kind: method
id: M:Autodesk.Revit.DB.MultiReferenceAnnotationOptions.Dispose
source: html/460247b8-791c-ff48-1147-267faac4e1c7.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationOptions.Dispose Method

Releases all resources used by the MultiReferenceAnnotationOptions

## Syntax (C#)
```csharp
public void Dispose()
```